In [2]:
import pandas as pd

import numpy as np

import os

In [5]:
full_student_data=os.path.join('..', 'resources','new_full_student_data.csv')

student_df=pd.read_csv(full_student_data)


student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [6]:
#check null figures

student_df.isnull().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [7]:
#drop null figures

student_df=student_df.dropna()

student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [8]:
#check for duplicates 

student_df.duplicated().sum()

#drop duplicates

student_df=student_df.drop_duplicates()

student_df.duplicated().sum()

0

In [9]:
#check dtypes

student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [10]:
#check and remove the 'th' from the grade column

student_df['grade']

student_df['grade']=student_df['grade'].str.replace('th',"")

student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [11]:
#change 'grade'to int not object

student_df['grade']=student_df['grade'].astype(int)

student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [12]:
#summerize data

student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [13]:
#display the mean of math_score

mean_math_score=student_df["math_score"].mean()

mean_math_score

64.67573326141189

In [14]:
#display min_reading_score

min_reading_score=student_df["reading_score"].min()

min_reading_score

10.5

In [15]:
#display first three rows of columns 3.4, and 5 using iloc

student_df.iloc[0:3,[3,4,5]]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [16]:
#select grade 9 and dispaly their summary stats

filter= student_df["grade"]==9

student_df.loc[filter].describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [17]:
#store the row with the min reading score as min_reading_row

min_reading_score=student_df["reading_score"].min()

min_reading_row=student_df.loc[student_df["reading_score"]==min_reading_score]

min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [35]:
#reading scores from 10th graders at dixon high school

Dixon_10th_graders=student_df.loc[(student_df["school_name"]=="Dixon High School")&
               (student_df["grade"]==10)]

Dixon_10th_graders=Dixon_10th_graders[["school_name","reading_score"]]

Dixon_10th_graders

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[569 rows x 2 columns]

In [44]:
#find the mean reading score for all students in grades 11 and 12

reading_scores=student_df.loc[(student_df["grade"]>10)&
                             (student_df["reading_score"])]


reading_scores=reading_scores["reading_score"]

reading_scores.mean()

74.90038089192188

In [51]:
#display the average budget for each school type

school_budgets=student_df.groupby("school_type")

school_budgets=school_budgets["school_type","school_budget"]

school_budgets.mean()

C:\Users\gskil\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:5: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [53]:
#find total number of students at each school and sort from largest to smallest

#no data on file for student count

In [55]:
#find average math score for each school type and their grade

average_math_score=student_df.groupby(["school_type", "grade"])

average_math_score=average_math_score["school_type", "grade","math_score"]

average_math_score.mean()

C:\Users\gskil\anaconda3\envs\PythonData\lib\site-packages\ipykernel_launcher.py:5: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """

                   grade  math_score
school_type grade
Charter     9        9.0   70.077874
            10      10.0   66.443206
            11      11.0   68.024735
            12      12.0   60.212121
Public      9        9.0   63.771066
            10      10.0   63.764121
            11      11.0   59.314337
            12      12.0   63.568319

In [ ]:
#findings

#Through the data it looks like the Charter schools have a better math score than the public school until their senior year

#even though the Charter schools receive less money for their budget overall they seem to be preparing their students better

#would be interesting to check other scores and see if seniors in the public schools are overall getting better average scores

#please note that the file given did not have any student counts in it so was unable to compare the size of schools to see

#if maybe a smaller school has a better avgerage test score.